Revit 2024 API
MEPCalculationServerInfo.Description Property
 The Description of the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Description { get; set; }
Visual Basic
Public Property Description As String
	Get
	Set
Visual C++
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace